# Pandas Series

In [1]:
import pandas as pd

# Creating Series using Default indexing

In [2]:
series1=pd.Series([1,2,3,"Text"])

In [3]:
series1

0       1
1       2
2       3
3    Text
dtype: object

# Creating Series using custom indexing

In [4]:
index1=[31,32,33,34,35,36]
ser2=pd.Series([1,2,3,4,5,6],index=index1)
ser2

31    1
32    2
33    3
34    4
35    5
36    6
dtype: int64

# Accessing elements in Series

In [5]:
ser2[31]

1

In [6]:
ser2[36]

6

# Creating Series using Dictionaries

In [7]:
ser3=pd.Series({"First Name":"Kunal","Surname":"Rawal","Address":"New Delhi"})

In [8]:
ser3

First Name        Kunal
Surname           Rawal
Address       New Delhi
dtype: object

# Performing Logical Operation

In [9]:
ser2

31    1
32    2
33    3
34    4
35    5
36    6
dtype: int64

In [10]:
ser2[ser2>4]

35    5
36    6
dtype: int64

# Pandas Data Frame

In [11]:
column1=[25,26,26,28]
column2=["Kunal","Rawal","Ajay","Vijay"]
df=pd.DataFrame({"Name":column2,"Marks":column1})
df

    Name  Marks
0  Kunal     25
1  Rawal     26
2   Ajay     26
3  Vijay     28

# Get Only first 2 Rows

In [12]:
df.head(2)

    Name  Marks
0  Kunal     25
1  Rawal     26

# Get Only bottom 2 Rows

In [13]:
df.tail(2)

    Name  Marks
2   Ajay     26
3  Vijay     28

# Printing All Columns

In [14]:
df.columns

Index(['Name', 'Marks'], dtype='object')

# Change the Name of Column

In [15]:
df.columns=['Student Name','Student Marks']

In [16]:
df

  Student Name  Student Marks
0        Kunal             25
1        Rawal             26
2         Ajay             26
3        Vijay             28

# Change The Name of Rows

In [17]:
df.index=['A','B','C','D']

In [18]:
df

  Student Name  Student Marks
A        Kunal             25
B        Rawal             26
C         Ajay             26
D        Vijay             28

# Accessing Only 1 Column

In [19]:
df['Student Name']

A    Kunal
B    Rawal
C     Ajay
D    Vijay
Name: Student Name, dtype: object

# Delete a Column

In [20]:
df2=df

In [21]:
df2

  Student Name  Student Marks
A        Kunal             25
B        Rawal             26
C         Ajay             26
D        Vijay             28

In [22]:
del df2['Student Marks']

In [23]:
df2

  Student Name
A        Kunal
B        Rawal
C         Ajay
D        Vijay

# Accessing Specific Row

In [24]:
df

  Student Name
A        Kunal
B        Rawal
C         Ajay
D        Vijay

In [25]:
df.iloc[1:3]

  Student Name
B        Rawal
C         Ajay

# Accessing Row index and specific Column

In [26]:
column1=[25,26,26,28]
column2=["Kunal","Rawal","Ajay","Vijay"]
column3=[18,17,18,19]
df=pd.DataFrame({"Name":column2,"Marks":column1,"Age":column3})
df

    Name  Marks  Age
0  Kunal     25   18
1  Rawal     26   17
2   Ajay     26   18
3  Vijay     28   19

In [27]:
df.iloc[1:3,2]

1    17
2    18
Name: Age, dtype: int64

# Accessing All Rows and Column

In [28]:
df.iloc[:,:]

    Name  Marks  Age
0  Kunal     25   18
1  Rawal     26   17
2   Ajay     26   18
3  Vijay     28   19

# Performing logical Operation

# Details of All the students who have age greater than 17

In [29]:
df[df['Age']>17]

    Name  Marks  Age
0  Kunal     25   18
2   Ajay     26   18
3  Vijay     28   19

# Details of All the students who have marks greater than 25

In [30]:
df[df['Marks']>25]

    Name  Marks  Age
1  Rawal     26   17
2   Ajay     26   18
3  Vijay     28   19

# Accessing Multiple Columns

In [31]:
df[['Name','Age']]

    Name  Age
0  Kunal   18
1  Rawal   17
2   Ajay   18
3  Vijay   19